import pytest

from multilingual_text_parser.data_types import Doc
from multilingual_text_parser.parser import TextParser

text_parser = TextParser(lang="KY")


testdata = [
    # количественные числительные
    ("123", "жүз жыйырма үч"),
    ("2,5", "эки бүтүн беш"),
    ("2.5", "эки бүтүн беш"),
    (
        "100000000000000000000000000000",
        "бир ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль ноль",
    ),
    # порядковые числительные
    ("1-орун", "биринчи орун"),
    # даты и года
    (
        "ал 2001-жылы 25-декабрда төрөлгөн",
        "ал эки миң биринчи жылы жыйырма бешинчи декабрда төрөлгөн",
    ),
    (
        "ал 25.12.2001 төрөлгөн",
        "ал жыйырма бешинчи декабрь эки миң бир төрөлгөн",
    ),
    ("03.31.2001", "отуз биринчи март эки миң бир"),
    ("2001/03/31", "отуз биринчи март эки миң бир"),
    ("2001/31/03", "отуз биринчи март эки миң бир"),
    ("1990-1995", "бир миң тогуз жүз токсон бир миң тогуз жүз токсон беш"),
    # символы
    ("№1", "саны бир"),
    ("23%", "жыйырма үч процент"),
    ("-1", "минус бир"),
    ("+1", "плюс бир"),
    # валюта
    ("$ 10", "он доллар"),
    ("€ 10", "он евро"),
    ("¥ 10", "он юань"),
    ("£ 10", "он фунт стерлинг"),
    ("$ 10.05", "он доллар беш цент"),
    # номер телефона
    (
        "+996312999084",
        "плюс тогуз жүз токсон алты үч жүз он эки тогуз жүз токсон тогуз сексен төрт",
    ),
]


@pytest.mark.parametrize("text, expected", testdata)
def test_normalizer(text, expected):
    doc = text_parser.process(Doc(text))
    assert doc.text.rstrip(".") == expected
