import pytest

from multilingual_text_parser.data_types import Doc
from multilingual_text_parser.parser import TextParser

text_parser = TextParser(lang="KK")


testdata = [
    # количественные числительные
    ("123", "жүз жиырма үш"),
    ("2,5", "екі бүтін бес"),
    ("2.5", "екі бүтін бес"),
    (
        "100000000000000000000000000000",
        "бір нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл нөл",
    ),
    # даты и года
    ("03.31.2001", "отыз бірінші март екі мың бір"),
    ("2001/03/31", "отыз бірінші март екі мың бір"),
    ("2001/31/03", "отыз бірінші март екі мың бір"),
    ("1990-1995", "бір мың тоғыз жүз тоқсан бір мың тоғыз жүз тоқсан бес"),
    # символы
    ("№1", "саны бір"),
    ("23%", "жиырма үш пайыз"),
    ("-1", "минус бір"),
    ("+1", "плюс бір"),
    # валюта
    ("$ 10", "он доллар"),
    ("€ 10", "он еуро"),
    ("¥ 10", "он юань"),
    ("£ 10", "он фунт стерлинг"),
    ("$ 10.05", "он доллар бес цент"),
    # номер телефона
    ("+71299908400", "плюс жеті жүз жиырма тоғыз тоғыз жүз тоқсан сексен төрт нөл нөл"),
    (
        "+7(129)990-84-00",
        "плюс жеті жүз жиырма тоғыз тоғыз жүз тоқсан сексен төрт нөл нөл",
    ),
    ("8(129)990-84-00", "сегіз жүз жиырма тоғыз тоғыз жүз тоқсан сексен төрт нөл нөл"),
    ("81299908400", "сегіз жүз жиырма тоғыз тоғыз жүз тоқсан сексен төрт нөл нөл"),
]


@pytest.mark.parametrize("text, expected", testdata)
def test_normalizer(text, expected):
    doc = text_parser.process(Doc(text))
    assert doc.text.rstrip(".") == expected
